In [1]:
import pandas as pd
import numpy as np

In [7]:
df = pd.read_csv('titanic_train.csv')
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [8]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [10]:
df.Survived.unique()

array([0, 1], dtype=int64)

In [16]:
l = [352, 246, 565, 636, 655, 899, 427, 249, 174, 257, 357, 578, 361, 802, 795, 670, 192, 784, 317, 154, 972, 689, 381, 741, 793, 723, 483, 432, 879, 245, 801, 163, 233, 925, 667, 884, 793, 280, 418, 632]

def norm(ls):
    nl = []
    mi = min(ls)
    dif = max(ls) - mi
    for i in ls:
        nl.append((i - mi)/dif)
    #print(nl)    
    return sum(nl)

norm(l)

[0.24205378973105135, 0.11246943765281174, 0.5024449877750611, 0.589242053789731, 0.6124694376528117, 0.910757946210269, 0.33374083129584353, 0.11613691931540342, 0.02444987775061125, 0.12591687041564792, 0.24816625916870416, 0.5183374083129584, 0.2530562347188264, 0.7921760391198044, 0.7836185819070904, 0.6308068459657702, 0.04645476772616137, 0.7701711491442543, 0.19926650366748166, 0.0, 1.0, 0.6540342298288508, 0.2775061124694376, 0.71760391198044, 0.7811735941320294, 0.69559902200489, 0.402200488997555, 0.33985330073349634, 0.8863080684596577, 0.11124694376528117, 0.7909535452322738, 0.011002444987775062, 0.09657701711491443, 0.9425427872860636, 0.6271393643031785, 0.8924205378973105, 0.7811735941320294, 0.15403422982885084, 0.32273838630806845, 0.5843520782396088]

18.880195599022002

In [17]:
a1 = [436, 584, 676, 127, 45, 476, 564, 593, 758, 458, 834, 113, 692, 789, 490, 805, 208, 822, 265, 768, 785, 680, 894, 821, 743, 916, 28, 896, 180, 836]
a2 = [214, 430, 454, 804, 329, 952, 38, 994, 288, 548, 214, 56, 620, 335, 209, 876, 580, 165, 678, 315, 343, 192, 184, 781, 921, 710, 217, 787, 639, 262]

np.corrcoef(a1,a2)

array([[1.        , 0.04622826],
       [0.04622826, 1.        ]])

In [18]:
a1 = np.array([127, 45, 476, 564, 593, 758, 458, 834, 113, 692, 789, 490, 805, 208, 822, 265, 768, 785, 680, 894, 821, 743, 916])
a2 = np.array([804, 329, 952, 38, 994, 288, 548, 214, 56, 620, 335, 209, 876, 580, 165, 678, 315, 343, 192, 184, 781, 921, 710])

np.linalg.norm(a1-a2)

2018.4469277144742

In [ ]:
2018